import 'package:flutter/services.dart';

import 'package:path/path.dart';
import 'dart:io';
import 'zikr.dart';

class AzkarList {
  static final List<Zikr> azkarSabah = [
    Zikr(
      text:
          'اللهمَّ أَنْتَ رَبِّي لا إِلَهَ إلا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي؛ فَإِنَّهُ لا يَغْفِرُ الذُّنُوبَ إلا أَنْتَ.',
      count: 1,
    ),
    Zikr(
      text: 'سُبْحانَ اللَّهِ وبِحَمْدِهِ.',
      count: 100,
    ),
    Zikr(
      text:
          'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.َ',
      count: 3,
    ),
    Zikr(
      text:
          'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
      count: 3,
    ),
    Zikr(
      text:
          'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
      count: 3,
    ),
    Zikr(
      text:
          'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّشُورُ.',
      count: 1,
    ),
    Zikr(
      text:
          'أصْبَحْنا وأصْبَحَ المُلْكُ لِلَّهِ، والحَمْدُ لِلَّهِ لا إِلهَ إِلاَّ اللَّهُ وَحدَهُ لا شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ على كُلَّ شَيْءٍ قَديرٌ، رَبّ أسألُكَ خَيْرَ ما فِي هَذَا اليَوم وَخَيْرَ مَا بَعْدَه وأعُوذ بِكَ مِنْ شَرّ ما في هَذَا اليَوم وَشَرّ مَا بَعْدَه، رَبّ أَعُوذُ بِكَ مِنَ الكَسَل وَالهَرَمِ وَسُوءِ الكِبَرِ، أعُوذُ بِكَ مِنْ عَذَابٍ في النَّارِ وَعَذَابٍ في القَبْرِ.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، عالِمَ الغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أشْهَدُ أن لا إلهَ إِلاَّ أنْتَ، أعُوذُ بِكَ مِنْ شَرّ نَفْسِي وَشَرِّ الشَّيْطانِ وَشِرْكِهِ وأنْ نَقْتَرِفَ سُوءاً عَلى أنْفُسِنا أوْ نَجُرَّهُ إلى مُسْلِم.',
      count: 1,
    ),
    Zikr(
      text:
          'باسْمِ اللَّهِ الَّذي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأرْضِ وَلا في السَّماءِ وَهُوَ السَّمِيعُ العَلِيم.',
      count: 3,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إِنِّي أصْبَحْتُ أُشْهِدُكَ وأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ أنَّكَ أنْتَ لا إِلهَ إِلاَّ أنْتَ، وأنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ.',
      count: 4,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إني أسألُكَ العافِيَةَ فِي الدُّنْيَا والآخِرَةِ، اللَّهُمَّ إني أسألُكَ العَفْوَ وَالعَافِيَةَ في دِيني وَدُنْيَايَ وأهْلِي ومَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وآمِنْ رَوْعاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْن يَدَيَّ ومِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمالِي وَمِنْ فَوْقِي، وأعُوذُ بِعَظَمَتِكَ أنْ أُغْتالَ مِنْ تَحْتِي.',
      count: 1,
    ),
    Zikr(
      text:
          'لا إلهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ على كُلّ شَيْءٍ قَدِير.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ عافِني فِي بَدَني، اللَّهُمَّ عافِنِي في سَمْعِي، اللَّهُمَّ عافِني في بَصَري، اللَّهُمَّ إني أعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ، اللَّهُمَّ إني أعُوذَ بِكَ مِنْ عَذَابِ القَبرِ، لا إِلهَ إِلاَّ أنْتَ.',
      count: 3,
    ),
    Zikr(
      text:
          'سُبْحانَ اللَّه وبِحَمْدِهِ، لا قُوَّةَ إِلاَّ باللَّهِ، ما شاءَ اللَّه كَانَ، ومَا لَمْ يَشأ لَمْ يَكُن، أعْلَمُ أنَّ اللَّهَ على كُلّ شَيْءٍ قَدِيرٌ، وأَنَّ اللَّهَ قَدْ أحاطَ بِكُلِّ شَيْءٍ عِلْماً.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إِني أعُوذُ بِكَ مِنَ الهَمّ والحُزن، وأعُوذُ بِكَ مِنَ العَجْزِ والكَسَلِ، وأعُوذُ بِكَ مِنَ الجُبْنِ والبُخلِ، وأعوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرّجالِ.',
      count: 1,
    ),
    Zikr(
      text:
          'أصْبَحْنَا على فِطْرَةِ الإِسْلامِ، وكَلِمَةِ الإِخْلاصِ، وَدِيْنِ نبِيِّا مُحَمَّدٍ صلى اللّه عليه وسلم، وَمِلَّةِ إِبْرَاهِيمَ صلى اللّه عليه وسلم حَنِيفاً مُسْلِماً ومَا أنا مِنَ المُشْرِكِينَ.',
      count: 1,
    ),
    Zikr(
      text:
          'يا حَيُّ يَا قَيُّومُ بِكَ أسْتَغِيثُ فأصْلِحْ لي شأنِي كُلَّهُ وَلاَ تَكِلْني إلى نَفْسِي طَرْفَةَ عَيْن.',
      count: 1,
    ),
  ];

  static final List<Zikr> azkarMasaa = [
    Zikr(
      text:
          'اللهمَّ أَنْتَ رَبِّي لا إِلَهَ إلا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي؛ فَإِنَّهُ لا يَغْفِرُ الذُّنُوبَ إلا أَنْتَ.',
      count: 1,
    ),
    Zikr(
      text: 'سُبْحانَ اللَّهِ وبِحَمْدِهِ.',
      count: 100,
    ),
    Zikr(
      text:
          'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.َ',
      count: 3,
    ),
    Zikr(
      text:
          'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
      count: 3,
    ),
    Zikr(
      text:
          'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
      count: 3,
    ),
    Zikr(
      text:
          'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّشُورُ.',
      count: 1,
    ),
    Zikr(
      text:
          'أمْسَيْنا وأمْسَىَ المُلْكُ لِلَّهِ، والحَمْدُ لِلَّهِ لا إِلهَ إِلاَّ اللَّهُ وَحدَهُ لا شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ على كُلَّ شَيْءٍ قَديرٌ، رَبّ أسألُكَ خَيْرَ ما فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَها وأعُوذ بِكَ مِنْ شَرّ ما في هَذِهِ اللَّيْلَةِ وَشَرّ مَا بَعْدَهَا، رَبّ أَعُوذُ بِكَ مِنَ الكَسَل وَالهَرَمِ وَسُوءِ الكِبَرِ، أعُوذُ بِكَ مِنْ عَذَابٍ في النَّارِ وَعَذَابٍ في القَبْرِ.',
      count: 1,
    ),
    Zikr(
      text: 'أعُوذُ بِكَلِماتِ اللَّهِ التَّامَّاتِ مِنْ شَرّ ما خَلَقَ.',
      count: 3,
    ),
    Zikr(
      text:
          'اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، عالِمَ الغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أشْهَدُ أن لا إلهَ إِلاَّ أنْتَ، أعُوذُ بِكَ مِنْ شَرّ نَفْسِي وَشَرِّ الشَّيْطانِ وَشِرْكِهِ وأنْ نَقْتَرِفَ سُوءاً عَلى أنْفُسِنا أوْ نَجُرَّهُ إلى مُسْلِم.',
      count: 1,
    ),
    Zikr(
      text:
          'باسْمِ اللَّهِ الَّذي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأرْضِ وَلا في السَّماءِ وَهُوَ السَّمِيعُ العَلِيم.',
      count: 3,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إني أسألُكَ العافِيَةَ فِي الدُّنْيَا والآخِرَةِ، اللَّهُمَّ إني أسألُكَ العَفْوَ وَالعَافِيَةَ في دِيني وَدُنْيَايَ وأهْلِي ومَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وآمِنْ رَوْعاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْن يَدَيَّ ومِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمالِي وَمِنْ فَوْقِي، وأعُوذُ بِعَظَمَتِكَ أنْ أُغْتالَ مِنْ تَحْتِي.',
      count: 1,
    ),
    Zikr(
      text:
          'لا إلهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ على كُلّ شَيْءٍ قَدِير.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ عافِني فِي بَدَني، اللَّهُمَّ عافِنِي في سَمْعِي، اللَّهُمَّ عافِني في بَصَري، اللَّهُمَّ إني أعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ، اللَّهُمَّ إني أعُوذَ بِكَ مِنْ عَذَابِ القَبرِ، لا إِلهَ إِلاَّ أنْتَ.',
      count: 3,
    ),
    Zikr(
      text:
          'سُبْحانَ اللَّه وبِحَمْدِهِ، لا قُوَّةَ إِلاَّ باللَّهِ، ما شاءَ اللَّه كَانَ، ومَا لَمْ يَشأ لَمْ يَكُن، أعْلَمُ أنَّ اللَّهَ على كُلّ شَيْءٍ قَدِيرٌ، وأَنَّ اللَّهَ قَدْ أحاطَ بِكُلِّ شَيْءٍ عِلْماً.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إِني أعُوذُ بِكَ مِنَ الهَمّ والحُزن، وأعُوذُ بِكَ مِنَ العَجْزِ والكَسَلِ، وأعُوذُ بِكَ مِنَ الجُبْنِ والبُخلِ، وأعوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرّجالِ.',
      count: 1,
    ),
    Zikr(
      text:
          'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.',
      count: 1,
    ),
  ];

  static final List<Zikr> azkarNawm = [
    Zikr(
      text:
          'بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبي، وَبِكَ أَرْفَعُه، فَإِن أَمْسَكْتَ نَفْسي فارْحَمْها، وَإِنْ أَرْسَلْتَها فاحْفَظْها بِما تَحْفَظُ بِه عِبادَكَ الصّالِحين.',
      count: 1,
    ),
    Zikr(
      text:
          'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.َ',
      count: 3,
    ),
    Zikr(
      text:
          'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
      count: 3,
    ),
    Zikr(
      text:
          'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
      count: 3,
    ),
    Zikr(
      text:
          'آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.َ',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الأرْضِ وَرَبََّ العَرْشِ العَظِيمِ، رَبَّنا وَرَبَّ كُلِّ شَيْءٍ، فالِقَ الحَبّ وَالنَّوَى، مُنَزِّل التَّوْرَاةِ وَالإِنجِيلِ وَالقُرآنِ، أعُوذُ بِكَ مِنْ شَرّ كُلّ ذِي شَرٍّ أنْتَ آخِذٌ بِنَاصِيَتِهِ؛ أنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وأنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وأنْتَ الباطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ، وأغْنِنا مِنَ الفَقْرِ.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إِنِّي أعُوذُ بِوَجْهِكَ الكَرِيمِ وَبِكَلِماتِكَ التَّامَّةِ مِنْ شَر ما أنْتَ آخِذٌ بِناصِيَتِهِ، اللَّهُمّ أنْتَ تَكْشِفُ المَغْرَمَ والمَأثمَ، اللَّهُمَّ لا يُهْزَمُ جُنْدُكَ وَلا يُخْلَفُ وَعْدُكَ، وَلاَ يَنْفَعُ ذَا الجَدّ مِنْكَ الجَدُّ، سُبْحانَكَ وَبِحَمْدِك.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، عالِمَ الغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أشْهَدُ أن لا إلهَ إِلاَّ أنْتَ، أعُوذُ بِكَ مِنْ شَرّ نَفْسِي وَشَرِّ الشَّيْطانِ وَشِرْكِهِ وأنْ نَقْتَرِفَ سُوءاً عَلى أنْفُسِنا أوْ نَجُرَّهُ إلى مُسْلِمٍ.',
      count: 1,
    ),
    Zikr(
      text:
          'الحَمْدُ لِلَّهِ الَّذي أطْعَمَنا وَسَقَانا، وكَفانا وآوَانا، فَكَمْ مِمَّنْ لا كافِيَ لَهُ وَلا مُؤْوِي.',
      count: 1,
    ),
    Zikr(
      text:
          'أعُوذُ بِكَلِماتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقابِهِ وَشَرِّ عِبَادِهِ، وَ مِنْ هَمَزَاتِ الشَّياطِينِ وأنْ يَحْضُرُون.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ أسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أمْرِي إِلَيْكَ، وَألجأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةَ وَرَهْبَةً إِلَيْكَ، لا ملجأ وَلا مَنْجَى مِنْكَ إِلاَّ إِليْكَ، آمَنْتُ بِكِتابِكَ الَّذي أنْزَلْتَ، وَنَبِيِّكَ الَّذي أَرْسَلْتَ.',
      count: 1,
    ),
  ];

  static final List<Zikr> azkarSalah = [
    Zikr(
      text: 'أسْتَغْفِرُ اللَّه.',
      count: 3,
    ),
    Zikr(
      text:
          'اللَّهُمَّ أنْتَ السَّلامُ وَمِنْكَ السَّلامُ، تَبارَكْتَ يا ذَا الجَلالِ وَالإِكْرام.',
      count: 1,
    ),
    Zikr(
      text:
          'لا إلهَ إِلاَّ اللَّهُ وَحدَهُ لا شَريكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَة كُلّ شَيْءٍ قَدِيرٌ، لا حَوْلَ وَلاَ قُوَّةَ إِلاَّ باللّه، لا إِلهَ إِلاَّ اللّه وَلاَ نَعْبُدُ إِلاَّ إيَّاهُ، لَهُ النِّعْمَةُ ولَهُ الفَضْلُ، وَلَهُ الثَّناءُ الحَسَنُ، لا إلهَ إِلاَّ اللّه مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الكافِرُون.',
      count: 1,
    ),
    Zikr(
      text: 'سُبحَان اللَّه.',
      count: 33,
    ),
    Zikr(
      text: 'الحمد للَّه.',
      count: 33,
    ),
    Zikr(
      text: 'اللَّه أكبر.',
      count: 33,
    ),
    Zikr(
      text:
          'لا إِلهَ إِلاَّ اللَّهُ وَحْدَهُ لا شَرِيكَ له، لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ على كُلّ شَيْءٍ قَدِيرٌ.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ لا مانِعَ لِمَا أعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَد.',
      count: 1,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الجُبْنِ، وَأعُوذُ بِكَ أنْ أُرَدَّ إلى أَرْذَلِ العمُرِ، وأعُوذُ بِكَ مِنْ فتْنَةِ الدُّنْيا، وأعُوذُ بِكَ منْ عَذَابِ القَبْر.',
      count: 1,
    ),
    Zikr(
      text: 'اللَّهُمَّ أعِنِّي على ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبادَتِك.',
      count: 1,
    ),
  ];
  static final List<Zikr> azkarMotafreqa = [
    Zikr(
      text:
          'اللهمَّ إني عبدُك، وابنُ عبدِك، وابنُ أَمَتِك، ناصيتي بيدِك، ماضٍ فيَّ حكمُك، عدلٌ فيَّ قضاؤُك، أسألُك بكلِّ اسمٍ هو لك سميتَ به نفسَك، أو علَّمتَه أحدًا من خلقِك، أو أنزلتَه في كتابِك، أو استأثرتَ به في علمِ الغيبِ عندَك، أن تجعلَ القرآنَ ربيعَ قلبي، ونورَ صدري، وجلاءَ حزني، وذَهابَ همِّي.',
      title: 'دعاء الهم والحزن',
      count: 0,
    ),
    Zikr(
      text:
          'لاَ إِلهَ إِلاَّ اللَّهُ العَظِيمُ الحَلِيمُ، لا إِلهَ إِلاَّ اللَّهُ رَبُّ العَرْشِ العَظِيمِ، لا إِلهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الأرْضِ رَبُّ العَرْشِ الكَرِيمُ.',
      title: 'دعاء الكرب',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إنِّي أسْتَخِيرُكَ بِعِلْمِكَ، وأسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأسألُكَ مِنْ فَضْلِكَ العَظِيمِ، فإنَّكَ تَقْدِرُ ولا أَقْدِرُ، وَتَعْلَمُ وَلا أعْلَمُ، وأنْتَ عَلاَّمُ الغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أنَّ هَذَا الأمْرَ (ويسمي حاجته) خَيْرٌ لي فِي دِيني وَمَعاشِي وَعاقِبَةِ أمْرِي، فاقْدُرْهُ لِي وَيَسِّرْهُ لي، ثُم بارِكْ لي فِيهِ، وَإنْ كُنْتَ تَعْلَمُ أنَّ هَذَا الأمْرَ (ويسمي حاجته) شَرٌّ لي في دِينِي وَمعاشِي وَعاقِبَةِ أمْرِي، فاصْرِفْهُ عَنِّي، وَاقْدُرْ لِيَ الخَيْرَ حَيْثُ كانَ ثُمَّ رَضِّنِي بِه.',
      title: 'دعاء الاستخارة',
      count: 0,
    ),
    Zikr(
      text:
          'بسمِ اللهِ، توَكَّلتُ على اللهِ، اللَّهمَّ إني أعوذُ بك أنْ أَضِلَّ أو أُضَلَّ، أو أَزِلَّ أوْ أُزَلَّ، أو أظْلِمَ أو أظْلَمَ، أو أجْهلَ أو يُجهَلَ عليَّ.',
      title: 'دعاء الخروج من المنزل',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّه أكبر اللَّه أكبر اللَّه أكبر، سُبْحانَ الَّذي سَخَّرَ لَنا هَذَا وَما كُنَّا لَهُ مُقْرِنينَ، وَإِنَّا إلى رَبِّنَا لَمُنْقَلِبُونَ. اللَّهُمَّ إنَّا نَسألُكَ فِي سفَرِنَا هَذَا البِرَّ وَالتَّقْوَى، وَمِنْ العَمَلِ ما تَرْضَى، اللَّهُمَّ هَوّن عَلَيْنا سَفَرَنَا هَذَا، وَاطْوِ عَنّا بُعْدَهُ. اللَّهُمَّ أنْتَ الصَّاحِبُ فِي السَّفَرِ وَالخَلِيفَةُ في الأهْلِ. اللَّهُمَّ إني أعُوذُ بِكَ مِنْ وَعْثاءِ السَّفَرِ وكآبَةِ المَنْظَرِ وَسُوءِ المُنْقَلَبِ في المَالِ والأهْلِ.',
      title: 'دعاء السفر',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّهُمَّ رَبَّ النَّاسِ أذْهِبِ البأسَ، اشْفِ أنْتَ الشَّافِي، لا شِفاءَ إِلاَّ شِفاؤُكَ شِفاءً لا يُغادِرُ سَقَماًً.',
      title: 'الدعاء للمريض',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّهُمَّ لا سَهْلَ إِلاَّ ما جَعَلْتَهُ سَهْلاً، وأنْتَ تَجْعَلُ الحَزْنَ إذَا شِئْتَ سَهْلاً.',
      title: 'دعاء من استصعب عليه أمر',
      count: 0,
    ),
    Zikr(
      text:
          'الحَمْدُ لِلَّهِ الَّذي أحْيانا بَعْدَما أماتَنا وإلَيْهِ النشُورُ.',
      title: 'دعاء الاستيقاظ من النوم',
      count: 0,
    ),
    Zikr(
      text:
          'أشْهَدُ أنْ لا إله إلاَّ اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ، وَأنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ باللَّهِ رَبّاً، وبِمُحَمَّدٍ صلى اللّه عليه وسلم رَسُولاً، وبالإِسْلامِ دِيناً.',
      title: 'الذكر بعد الأذان',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّهُمَّ رَبِّ هَذهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاةِ القائِمةِ، آتِ مُحَمَّداً الوَسِيلَةَ والفَضِيلَةَ، وابْعَثْهُ مَقاماً محموداً الذي وَعَدْتَهُ.',
      title: 'الذكر بعد الأذان',
      count: 0,
    ),
    Zikr(
      text:
          'أشْهَدُ أنْ لا إله إِلاَّ اللَّهُ وَحْدَهُ لا شَرِيك لَهُ، وأشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، اللَّهُمَّ اجْعَلْنِي مِنَ التَوَّابِينَ، واجْعَلْني مِنَ المُتَطَهِّرِينَ، سُبْحانَكَ اللَّهُمَّ وبِحَمْدِكَ، أشْهَدُ أنْ لا إلهَ إِلاَّ أنْتَ، أسْتَغْفِرُكَ وأتُوبُ إِليك',
      title: 'الدعاء بعد الوضوء',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّهُمَّ اجْعَلْ في قَلْبِي نُوراً، وفي لِسانِي نُوراً، وَاجْعَلْ في سَمْعِي نُوراً، وَاجْعَلْ في بَصَري نُوراً، وَاجْعَلْ مِنْ خَلْفِي نُوراً، وَمِنْ أمامي نُوراً، وَاجْعَلْ مِنْ فَوْقي نُوراً وَمِنْ تَحْتِي نُوراً، اللَّهُمَّ أعْطِني نُوراً.',
      title: 'دعاء الذهاب إلى المسجد',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّهُمَّ صَلِّ وسَلّم على مُحَمَّدٍ، اللَّهُمَّ افْتَحْ لي أبْوَابَ رَحْمَتِكَ.',
      title: 'دعاء دخول المسجد',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّهُمَّ صَلِّ وسَلّم على مُحَمَّدٍ، اللَّهُمَّ إني أسألُكَ مِنْ فَضْلِكَ.',
      title: 'دعاء الخروج من المسجد',
      count: 0,
    ),
    Zikr(
      text:
          'اللَّهُمَّ إِني أعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمنْ عَذَابِ القَبْرِ، وَمِنْ فِتْنَةِ المَحْيا والمَماتِ، وَمِنْ شَرِّ فِتْنَة المَسِيحِ الدَّجَّال.',
      title: 'الدعاء بعد التشهد الأخير',
      count: 0,
    ),
    Zikr(
      text: 'اللَّهُمَّ إني أعُوذُ بِكَ مِنَ الخُبْثِ وَالخَبَائث.',
      title: 'دعاء دخول الخلاء',
      count: 0,
    ),
    Zikr(
      text: 'غُفْرَانَك.',
      title: 'دعاء الخروج من الخلاء',
      count: 0,
    ),
  ];

  static List<Zikr> getAzkarList(String title) {
    if (title == 'أذكار الصباح') return azkarSabah;
    if (title == 'أذكار المساء') return azkarMasaa;
    if (title == 'أذكار الصلاة') return azkarSalah;
    if (title == 'أذكار النوم') return azkarNawm;
    if (title == 'أذكار متفرقة') return azkarMotafreqa;
    return [];
  }
}
